src/runtime/emgrs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-27 Thu 04:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Application specific constraints and Entity Managers</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD VLEAD" />
<link rel="stylesheet" type="text/css" href="../../style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="../../style/css/override.css" />
<link rel="icon" type="image/png" href="../../style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Application specific constraints and Entity Managers</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline2">2. Referential integrity constraints</a></li>
<li><a href="#orgheadline3">3. Uniqueness integrity constraints</a></li>
<li><a href="#orgheadline8">4. Summary of constraints</a>
<ul>
<li><a href="#orgheadline4">4.1. Object Level Constraints</a></li>
<li><a href="#orgheadline5">4.2. Object Equality definition and Unique Key identification</a></li>
<li><a href="#orgheadline6">4.3. Uniformity and Uniqueness constraints on entity sets</a></li>
<li><a href="#orgheadline7">4.4. Application specific referential integrity constraints</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document lists all 
</p>

<ul class="org-ul">
<li>the application specific referential integrity
constraints</li>

<li>and the entity managers that ensure these constraints.</li>
</ul>
</div>
</div>



<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Referential integrity constraints</h2>
<div class="outline-text-2" id="text-2">
<p>
Every safe entity manager (persistent or volatile) must
ensure referential integrity of the entities it aggregates.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Uniqueness integrity constraints</h2>
<div class="outline-text-2" id="text-3">
<p>
This constraint is ensured by the safe Utility Entity
Manager. 
</p>
</div>
</div>




<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">4</span> Summary of constraints</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">4.1</span> Object Level Constraints</h3>
<div class="outline-text-3" id="text-4-1">
<dl class="org-dl">
<dt><a href="../objects/email/index.html">Email</a></dt><dd><code>val</code> field is a valid email string.</dd>

<dt><a href="../objects/name/index.html">Name</a></dt><dd><code>val</code> field is an alphabetic string.</dd>

<dt><a href="../objects/role/index.html">Role</a></dt><dd><code>val</code> field is either "admin" or "user"</dd>

<dt><a href="../objects/user/index.html">User</a></dt><dd><code>email</code> field is an <code>Email</code>, <code>name</code> field is a
<code>Name</code>, and <code>roles</code> field is a list of =Role=s.</dd>

<dt><a href="../objects/session/index.html">Session</a></dt><dd><code>user</code> field is a <code>User</code>, <code>key</code> field is a
String and <code>role</code> field is <code>Role</code>.  Furthermore, a
session's role must occur in the list of roles of the
session's user.  See test case
<code>test_user_role_mismatch</code> in the <a href="../objects/session/tests/create_session_exc.html">TestCreateSessionExc</a>
class that demonstrates this constraint.</dd>
</dl>


<p>
The object level constraints are specified when the object's
class is defined using <code>PropertyClassFactory.mk_class</code>.   
</p>

<p>
The constraints are checked every time the object is
created. 
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">4.2</span> Object Equality definition and Unique Key identification</h3>
<div class="outline-text-3" id="text-4-2">
<dl class="org-dl">
<dt><a href="../objects/email/index.html">Email</a></dt><dd>Two emails are considered equal if their <code>val</code>
     fields are equal.  <code>val</code> is the unique key.</dd>

<dt><a href="../objects/name/index.html">Name</a></dt><dd>Two Names are considered equal if their <code>val</code>
     fields are equal. <code>val</code> is the unique key.</dd>

<dt><a href="../objects/role/index.html">Role</a></dt><dd>Two roles are considered equal if their <code>val</code>
     fields are equal.  <code>val</code> is the unique key.</dd>

<dt><a href="../objects/user/index.html">User</a></dt><dd>Two users are considered equal if their <code>email</code>
     fields are equal.  <code>email</code> is the unique key.</dd>

<dt><a href="../objects/session/index.html">Session</a></dt><dd>Two sessions are considered equal if their
<code>key</code> fields are equal.  <code>key</code> is the unique key.</dd>
</dl>



<p>
The object equality definition and unique key identification
are specified when the object's class is defined using
<code>PropertyClassFactory.mk_class</code>.
</p>

<p>
They are checked every time two objects are compared for
equality.
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">4.3</span> Uniformity and Uniqueness constraints on entity sets</h3>
<div class="outline-text-3" id="text-4-3">
<p>
These are constraints in the aggregates of entities:
No two entities in the aggregate have the same unique key.
</p>

<p>
In the application there are only two primary aggregates:
</p>

<dl class="org-dl">
<dt>User set</dt><dd><ol class="org-ol">
<li>All objects in the User set are instances of
<code>User</code>.  [Uniformity]</li>

<li>No two objects in the user set have the same
<code>email</code> field.  [Uniqueness]</li>
</ol></dd>

<dt>Session set</dt><dd><ol class="org-ol">
<li>All objects in the Session set are instances of
<code>Session</code>.   [Uniformity]</li>

<li>No two objects in the Session set have the same
<code>key</code> field.  [Uniqueness]</li>
</ol></dd>
</dl>


<p>
In the implementation, this is enforced by a more general
manner.  
</p>

<ul class="org-ul">
<li>The uniformity constraint is implemented by the
<a href="../utils/entitymgrs/volatile/unsafe/index.html">UnsafeVolatileEntityMgr</a> utility class.</li>

<li>The uniqueness constraint is implemented by the
<a href="../utils/entitymgrs/volatile/safe/index.html">SafeVolatileEntityMgr</a> utility class.</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">4.4</span> Application specific referential integrity constraints</h3>
<div class="outline-text-3" id="text-4-4">
<p>
These are constraints on the user and session aggregates.
</p>

<dl class="org-dl">
<dt>1. Session-user referential integrity constraint</dt><dd>If
<code>s</code> is a session in the session aggregate, then the
<code>s</code>'s user is present in the user aggregate.</dd>
</dl>

<p>
This constraint is implemented by the application specific
<a href="./svem/index.html">EntityMgr</a> class in the <a href="./svem/index.html">svem</a> module. 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-04-25 Tue]</span></span></p>
<p class="author">Author: VLEAD VLEAD</p>
<p class="date">Created: 2017-04-27 Thu 04:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
